[
    {
        "name": "Email NetworkMessageId -> UrlClickEvents for Similar Emails",
        "description": "Finds URL click events from emails similar to the specified NetworkMessageId, based on sender, subject, and other attributes.",
        "requiredKvps": ["networkmessageid"],
        "template": "// Find URL clicks from similar emails to NetworkMessageId: {{networkmessageid}}\nlet NETWORKMESSAGEID = \"{{networkmessageid}}\";\nlet ARRAY_FROM_TABLE_COLUMN = (TABLE: (*), COLUMN:string) {\n        set_difference(toscalar(TABLE | summarize make_set(column_ifexists(COLUMN, \"\"))), dynamic([\"\"]))\n};\nlet GET_SIMILAR_EMAILS = (NETWORKMESSAGEID: string) {\n    let Attributes = materialize (\n        EmailEvents\n        | where NetworkMessageId =~ NETWORKMESSAGEID\n        | distinct \n            SenderMailFromAddress,\n            SenderMailFromDomain,\n            SenderDisplayName,\n            SenderFromAddress,\n            SenderFromDomain,\n            EmailClusterId,\n            Subject = tolower(Subject),\n            EmailSize\n        );\n    let INITIALSENDERMAILFROMADDRESSES = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderMailFromAddress\");\n    let INITIALSENDERMAILFROMDOMAINS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderMailFromDomain\");\n    let INITIALSENDERDISPLAYNAMES = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderDisplayName\");\n    let INITIALSENDERFROMADDRESSES = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderFromAddress\");\n    let INITIALSENDERFROMDOMAINS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderFromDomain\");\n    let INITIALEMAILCLUSTERIDS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"EmailClusterId\");\n    let INITIALSUBJECTS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"Subject\");\n    let AVGEMAILSIZE = tolong(toscalar(Attributes | summarize avg(EmailSize)));\n    let MINEMAILSIZE = 0.8*AVGEMAILSIZE;\n    let MAXEMAILSIZE = 1.2*AVGEMAILSIZE;\n    EmailEvents\n    | where \n        SenderMailFromAddress in~ (INITIALSENDERMAILFROMADDRESSES) or\n        SenderMailFromDomain in~ (INITIALSENDERMAILFROMDOMAINS) or\n        SenderDisplayName in~ (INITIALSENDERDISPLAYNAMES) or\n        SenderFromAddress in~ (INITIALSENDERFROMADDRESSES) or\n        SenderFromDomain in~ (INITIALSENDERFROMDOMAINS) or\n        EmailClusterId in (INITIALEMAILCLUSTERIDS)\n    | where EmailSize between (MINEMAILSIZE .. MAXEMAILSIZE) and DeliveryLocation !~ \"On-premises/external\"\n    | extend InitialSubjects = INITIALSUBJECTS\n    | mv-expand InitialSubject = InitialSubjects\n    | extend InitialSubject = tostring(InitialSubject)\n    | where (jaccard_index(extract_all(\"([a-z]+)\", tolower(Subject)), extract_all(\"([a-z]+)\",InitialSubject)) > 0.5 or EmailClusterId in (INITIALEMAILCLUSTERIDS))\n    | project-away Initial*\n    | summarize arg_max(Timestamp, *) by NetworkMessageId, RecipientEmailAddress\n};\nGET_SIMILAR_EMAILS(NETWORKMESSAGEID)\n| join kind=rightsemi UrlClickEvents on NetworkMessageId"
    },
    {
        "name": "Email NetworkMessageId -> Similar Emails",
        "description": "Finds emails similar to the specified NetworkMessageId, based on sender, subject, and other attributes.",
        "requiredKvps": ["networkmessageid"],
        "template": "// Find similar emails to NetworkMessageId: {{networkmessageid}}\nlet NETWORKMESSAGEID = \"{{networkmessageid}}\";\nlet ARRAY_FROM_TABLE_COLUMN = (TABLE: (*), COLUMN:string) {\n        set_difference(toscalar(TABLE | summarize make_set(column_ifexists(COLUMN, \"\"))), dynamic([\"\"]))\n};\nlet GET_SIMILAR_EMAILS = (NETWORKMESSAGEID: string) {\n    let Attributes = materialize (\n        EmailEvents\n        | where NetworkMessageId =~ NETWORKMESSAGEID\n        | distinct \n            SenderMailFromAddress,\n            SenderMailFromDomain,\n            SenderDisplayName,\n            SenderFromAddress,\n            SenderFromDomain,\n            EmailClusterId,\n            Subject = tolower(Subject),\n            EmailSize\n        );\n    let INITIALSENDERMAILFROMADDRESSES = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderMailFromAddress\");\n    let INITIALSENDERMAILFROMDOMAINS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderMailFromDomain\");\n    let INITIALSENDERDISPLAYNAMES = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderDisplayName\");\n    let INITIALSENDERFROMADDRESSES = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderFromAddress\");\n    let INITIALSENDERFROMDOMAINS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"SenderFromDomain\");\n    let INITIALEMAILCLUSTERIDS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"EmailClusterId\");\n    let INITIALSUBJECTS = ARRAY_FROM_TABLE_COLUMN(Attributes, \"Subject\");\n    let AVGEMAILSIZE = tolong(toscalar(Attributes | summarize avg(EmailSize)));\n    let MINEMAILSIZE = 0.8*AVGEMAILSIZE;\n    let MAXEMAILSIZE = 1.2*AVGEMAILSIZE;\n    EmailEvents\n    | where \n        SenderMailFromAddress in~ (INITIALSENDERMAILFROMADDRESSES) or\n        SenderMailFromDomain in~ (INITIALSENDERMAILFROMDOMAINS) or\n        SenderDisplayName in~ (INITIALSENDERDISPLAYNAMES) or\n        SenderFromAddress in~ (INITIALSENDERFROMADDRESSES) or\n        SenderFromDomain in~ (INITIALSENDERFROMDOMAINS) or\n        EmailClusterId in (INITIALEMAILCLUSTERIDS)\n    | where EmailSize between (MINEMAILSIZE .. MAXEMAILSIZE) and DeliveryLocation !~ \"On-premises/external\"\n    | extend InitialSubjects = INITIALSUBJECTS\n    | mv-expand InitialSubject = INITIALSUBJECTS\n    | extend InitialSubject = tostring(InitialSubject)\n    | where (jaccard_index(extract_all(\"([a-z]+)\", tolower(Subject)), extract_all(\"([a-z]+)\",InitialSubject)) > 0.5 or EmailClusterId in (INITIALEMAILCLUSTERIDS))\n    | project-away Initial*\n    | summarize arg_max(Timestamp, *) by NetworkMessageId, RecipientEmailAddress\n};\nGET_SIMILAR_EMAILS(NETWORKMESSAGEID)"
    },
    {
        "name": "Email NetworkMessageId -> DeviceFileEvents for Email Attachments",
        "description": "Finds DeviceFileEvents for attachments from the email with the specified NetworkMessageId.",
        "requiredKvps": ["networkmessageid"],
        "template": "// Find DeviceFileEvents for email attachments from email with NetworkMessageId: {{networkmessageid}}\nlet NETWORKMESSAGEID = \"{{networkmessageid}}\";\nlet Lookup = (TABLE: (*), KEY:string, VALUE:string) {\n    TABLE\n    | where column_ifexists(KEY, \"\") =~ VALUE\n};\nlet dynamicLookup = (SOURCE_TABLE: (*), TARGET_TABLE: (*), SOURCE_COLUMN:string, TARGET_COLUMN:string = \"\") {\n    let LOOKUPVALUES = set_difference(toscalar(SOURCE_TABLE | summarize make_set(column_ifexists(SOURCE_COLUMN, \"\"))), dynamic([\"\"]))\n    TARGET_TABLE\n    | where column_ifexists(TARGET_COLUMN, \"\") in~ (LOOKUPVALUES) and isnotempty(column_ifexists(TARGET_COLUMN, \"\"))\n};\ndynamicLookup(\nLookup(EmailAttachmentInfo, \"NetworkMessageId\", NETWORKMESSAGEID),\nDeviceFileEvents,\n\"SHA256\",\n\"SHA256\"\n)"
    },
    {
        "name": "Entra ID Protection Alert ID -> UrlClickEvents for Compromised User",
        "description": "Finds URL click events for a potentially compromised user based on an Entra ID Protection alert ID.",
        "requiredKvps": ["alertid"],
        "template": "// Entra ID Protection Alert: {{alertid}}\nlet ALERTID = \"{{alertid}}\";\nlet ARRAY_FROM_TABLE_COLUMN = (TABLE: (*), COLUMN:string) {\n        set_difference(toscalar(TABLE | summarize make_set(column_ifexists(COLUMN, \"\"))), dynamic([\"\"]))\n};\nlet GET_ALERT_EVIDENCE = (ALERT_ID:string) {\n    AlertEvidence\n    | where AlertId endswith ALERT_ID\n    | extend AdditionalFields = todynamic(AdditionalFields)\n    | extend MergeByKeyHex = tostring(AdditionalFields.MergeByKeyHex)\n    | summarize arg_max(column_ifexists(\"TimeGenerated\",Timestamp), *) by MergeByKeyHex\n    | evaluate bag_unpack(AdditionalFields, columnsConflict='keep_source')\n};\nlet GET_ACCOUNT_IDENTIFIER = (ACCOUNT_OBJECT_ID:string, OUTPUT_COLUMN:string){toscalar(\n    IdentityInfo\n    | where AccountObjectId == ACCOUNT_OBJECT_ID and isnotempty(column_ifexists(OUTPUT_COLUMN,\"\")) and Timestamp > ago(14d)\n    | summarize arg_max(Timestamp,*) by AccountObjectId\n    | project column_ifexists(OUTPUT_COLUMN,\"\"))\n};\nlet ALERTEVIDENCE =     materialize(GET_ALERT_EVIDENCE(ALERTID));\nlet SESSIONID =         tostring(ARRAY_FROM_TABLE_COLUMN((ALERTEVIDENCE),\"SessionId\")[0]);\nlet REQUESTID =         tostring(ARRAY_FROM_TABLE_COLUMN((ALERTEVIDENCE),\"RequestId\")[0]);\nlet ACCOUNTOBJECTID =   tostring(ARRAY_FROM_TABLE_COLUMN(ALERTEVIDENCE,\"AccountObjectId\")[0]);\nlet ACCOUNTUPN =        GET_ACCOUNT_IDENTIFIER(ACCOUNTOBJECTID, \"AccountUpn\");\nlet EMAILADDRESS =      GET_ACCOUNT_IDENTIFIER(ACCOUNTOBJECTID, \"EmailAddress\");\nlet SUSPICIOUSSIGNINS = materialize(\n    EntraIdSignInEvents\n    | where AccountObjectId =~ ACCOUNTOBJECTID\n    | where\n        SessionId =~ SESSIONID or\n        RequestId =~ REQUESTID\n    | join kind=rightsemi EntraIdSignInEvents on CorrelationId\n);\nlet MINSUSPICIOUSSIGNINTIMESTAMP = todatetime(toscalar(SUSPICIOUSSIGNINS | summarize min(Timestamp)));\nUrlClickEvents\n| where AccountUpn in~ (EMAILADDRESS, ACCOUNTUPN) and Timestamp between ((MINSUSPICIOUSSIGNINTIMESTAMP - 30m) .. MINSUSPICIOUSSIGNINTIMESTAMP)\n| summarize arg_max(Timestamp,*) by NetworkMessageId, Url\n| extend TimeDelta = MINSUSPICIOUSSIGNINTIMESTAMP - Timestamp\n| join kind=leftsemi (EmailEvents | where IsFirstContact) on NetworkMessageId"
    }
]
